typedef struct NFMattributes
{
     long    n_name;            /*    0    */
     long    n_dtype;           /*    1    */

     long    n_synonym;         /*    2    */
     long    n_nfmname;         /*    3    */

     long    n_opentonfm;       /*    4    */
     long    n_application;     /*    5    */

     long    n_read;            /*    6    */
     long    n_write;           /*    7    */
     long    n_update;          /*    8    */

     long    n_delete;          /*    9    */
     long    n_null;            /*   10    */

     long    n_keyin;           /*   11    */

     long    n_checkin;         /*   12    */
     long    n_checkout;        /*   13    */

     long    n_seqno;           /*   14    */
     long    n_listno;          /*   15    */

     long    new_n_name;        /*   16    */
     long    new_n_dtype;       /*   17    */

     long    new_n_synonym;     /*   18    */

     long    new_n_opentonfm;   /*   19    */
     long    new_n_application; /*   20    */

     long    new_n_read;        /*   21    */
     long    new_n_write;       /*   22    */
     long    new_n_update;      /*   23    */

     long    new_n_delete;      /*   24    */
     long    new_n_null;        /*   25    */

     long    new_n_keyin;       /*   26    */

     long    new_n_checkin;     /*   27    */
     long    new_n_checkout;    /*   28    */

     long    new_n_seqno;       /*   29    */
     long    new_n_listno;      /*   30    */
} NFMattributes;

